Управление ИТ фирмой/Catalogs/Контрагенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Контрагенты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПолноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Email</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>17</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФактическийАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮридическийАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЮридическоеФизическоеЛицо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Управление ИТ фирмой/Enums/ЮридическоеФизическоеЛицо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЮридическоеФизическоеЛицо</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮридическоеЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФизическоеЛицо</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Управление ИТ фирмой/Catalogs/Контрагенты/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ТипПриИзменении(Элемент)
	
	УстановитьВидимостьКПП();	
	
КонецПроцедуры 

&НаКлиенте
Процедура УстановитьВидимостьКПП()
	
	Если Объект.Тип = ПредопределенноеЗначение("Перечисление.ЮридическоеФизическоеЛицо.ЮридическоеЛицо") Тогда
		Элементы.КПП.Видимость = Истина;
	Иначе
		Элементы.КПП.Видимость = Ложь;
		
		Объект.КПП = ""; 
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ИННПриИзменении(Элемент)
	
	Если ПустаяСтрока(Объект.ИНН) Тогда
		Элементы.ДекорацияОшибкаИНН.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ИНН) Тогда
		Возврат;
	КонецЕсли;
	
	РезультатПроверки = ПроверитьИНННаСервере(Объект.ИНН, Объект.Тип);
	
	Если Не РезультатПроверки.Корректен Тогда
		Элементы.ДекорацияОшибкаИНН.Заголовок = РезультатПроверки.ТекстОшибки;
		Элементы.ДекорацияОшибкаИНН.Видимость = Истина;
	Иначе
		Элементы.ДекорацияОшибкаИНН.Видимость = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПроверитьИНННаСервере(Знач ИНН, Знач Тип)

	Возврат ПроверкаКорректностиИНН.КорректностьИНН(ИНН, Тип);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьПолноеНаименованиеИзКраткого(Знач КраткоеНаименование)

	КраткоеНаименование = СокрЛП(КраткоеНаименование); 
	
	Если ПустаяСтрока(КраткоеНаименование) Тогда
		Возврат "";
	КонецЕсли;
	
	Сокращения = Новый Соответствие;
	Сокращения.Вставить("ООО", "Общество с ограниченной ответственностью");
	Сокращения.Вставить("АО",  "Акционерное общество");
	Сокращения.Вставить("ЗАО", "Закрытое акционерное общество");
	Сокращения.Вставить("ИП",  "Индивидуальный предприниматель");
	Сокращения.Вставить("ПАО", "Публичное акционерное общество");
	
	МассивСлов = СтрРазделить(КраткоеНаименование, " ", Ложь);
	КоличествоСлов = МассивСлов.Количество();
	
	Если КоличествоСлов = 0 Тогда
		Возврат КраткоеНаименование;
	КонецЕсли;
	
	ПоследнееСлово = МассивСлов[КоличествоСлов - 1];
	
	КлючПоиска = СтрЗаменить(ПоследнееСлово, """", "");
	КлючПоиска = СтрЗаменить(КлючПоиска, "«", "");
	КлючПоиска = СтрЗаменить(КлючПоиска, "»", "");
	КлючПоиска = СтрЗаменить(КлючПоиска, ".", "");
	КлючПоиска = ВРег(СокрЛП(КлючПоиска));
	
	ПолнаяОПФ = Сокращения.Получить(КлючПоиска);
	
	Если ПолнаяОПФ <> Неопределено Тогда
		МассивСлов[КоличествоСлов - 1] = ПолнаяОПФ;
		Возврат СтрСоединить(МассивСлов, " ");
	КонецЕсли;
	
	Возврат КраткоеНаименование;
	
КонецФункции 

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПолноеИзКраткого = ПолучитьПолноеНаименованиеИзКраткого(ТекущийОбъект.Наименование);
	
	Если СокрЛП(ТекущийОбъект.ПолноеНаименование) = СокрЛП(ПолноеИзКраткого) Тогда
		ПолноеНаименованиеМожноИзменятьАвтоматически = Истина;
	Иначе
		ПолноеНаименованиеМожноИзменятьАвтоматически = Ложь;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	
	 НовоеПолноеНаименование = ПолучитьПолноеНаименованиеИзКраткого(Объект.Наименование);
	
	ТекущееПолное = СокрЛП(Объект.ПолноеНаименование);
	
	Если ПустаяСтрока(ТекущееПолное) 
		ИЛИ ТекущееПолное = СокрЛП(Объект.Наименование) 
		ИЛИ ТекущееПолное = ПолучитьПолноеНаименованиеИзКраткого(Объект.Наименование) Тогда
			Объект.ПолноеНаименование = НовоеПолноеНаименование;
	КонецЕсли;
	
КонецПроцедуры  

&НаКлиенте
Процедура ПолноеНаименованиеПриИзменении(Элемент)
	
    ПолноеНаименованиеМожноИзменятьАвтоматически = Ложь;
	
КонецПроцедуры
